from dadmatools.models.normalizer import Normalizer

if __name__ == '__main__':
    text = """
    شرکت فناوری دولتی «روستک» روسیهدر نمایشگاه بی‌ المللی هوایی «ماکس-۲۰۲۱»  در شهر «ژوکوفسکی» در حومه مسکو از جدیدترین جنگنده داخلی تک موتوره خود رونمایی کرد. این جنگنده هجدیدی تا حدودی ویژگی‌های جنگنده «سوخو-۵۷» روسیه را دارد. چک‌ میت اخیرا در نمایشگاه هوایی «دبی ۲۰۲۱» که در امارات متحده عربی برگزار شد، عرضه شد.

چک میت  جدیدترین سامانه‌ها از جمله پیکربندی آن و فناوری‌های هوش مصنوعی منحصر به فرد را دارد. این جنگنده تک موتوره جدید مجهز به انواع موشک‌های هوا به هوا و هوا به زمین مبتنی بر فناوری رادارگریز است و هفت تن  مهمات حمل می‌کند و می‌تواند تا ۶ هدف را در یک زمان مورد اصابت قرار دهد.
    """
    normalizer = Normalizer(full_cleaning=True)
    print(normalizer.normalize(text))
